Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 100)]             0         
_________________________________________________________________
embedding (Embedding)        (None, 100, 100)          456000    
_________________________________________________________________
bidirectional (Bidirectional (None, 100, 18)           5994      
_________________________________________________________________
global_max_pooling1d (Global (None, 18)                0         
_________________________________________________________________
dense (Dense)                (None, 1)                 19        
=================================================================
Total params: 462,013
Trainable params: 6,013
Non-trainable params: 456,000
_________________________________________________________________
